# Data Frame in Python with Pandas

dsdsdsdsdsds

In [2]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(data=np.array([[1,2,3],[5,6,7]], dtype=int), columns=['A','B','C'])
df

   A  B  C
0  1  2  3
1  5  6  7

In [3]:
pd.read_csv('E:/Python/zoo.csv', delimiter = ',')

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [5]:
zoo = pd.read_csv('E:/Python/zoo.csv', delimiter = ',')

In [6]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

In [7]:
zoo[['animal']].count()

animal    22
dtype: int64

In [8]:
zoo[['animal','water_need']].count()

animal        22
water_need    22
dtype: int64

In [9]:
zoo.animal.count()

22

In [10]:
zoo.water_need.count()

22

In [11]:
zoo.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

In [12]:
zoo.water_need.sum()

7650

In [13]:
zoo.water_need.min()

80

In [14]:
zoo.water_need.max()

600

In [15]:
zoo.animal.max()

'zebra'

In [16]:
zoo.animal.min()

'elephant'

In [17]:
zoo.water_need.mean()

347.72727272727275

In [18]:
zoo.water_need.median()

325.0

In [19]:
zoo.animal.median()

TypeError: could not convert string to float: 'elephant'

In [20]:
zoo.uniq_id.median()

1011.5

In [21]:
zoo[['animal','water_need']]

      animal  water_need
0   elephant         500
1   elephant         600
2   elephant         550
3      tiger         300
4      tiger         320
5      tiger         330
6      tiger         290
7      tiger         310
8      zebra         200
9      zebra         220
10     zebra         240
11     zebra         230
12     zebra         220
13     zebra         100
14     zebra          80
15      lion         420
16      lion         600
17      lion         500
18      lion         390
19  kangaroo         410
20  kangaroo         430
21  kangaroo         410

In [22]:
zoo.animal

0     elephant
1     elephant
2     elephant
3        tiger
4        tiger
5        tiger
6        tiger
7        tiger
8        zebra
9        zebra
10       zebra
11       zebra
12       zebra
13       zebra
14       zebra
15        lion
16        lion
17        lion
18        lion
19    kangaroo
20    kangaroo
21    kangaroo
Name: animal, dtype: object

In [23]:
zoo[zoo.animal == 'tiger']

  animal  uniq_id  water_need
3  tiger     1004         300
4  tiger     1005         320
5  tiger     1006         330
6  tiger     1007         290
7  tiger     1008         310

In [24]:
zoo[zoo.animal == 'tiger'].head()

  animal  uniq_id  water_need
3  tiger     1004         300
4  tiger     1005         320
5  tiger     1006         330
6  tiger     1007         290
7  tiger     1008         310

In [26]:
url = 'http://46.101.230.157/dilan/pandas_tutorial_read.csv'
column_names = ['my_datetime','event','country','user_id','source','topic']
article_read = pd.read_csv(url, delimiter=';',names = column_names)

In [27]:
article_read

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [30]:
article_read[['user_id','country','topic']].country == 'country_2'.head()

AttributeError: 'str' object has no attribute 'head'

In [32]:
article_read[['user_id','country','topic']].head()

      user_id    country          topic
0  2458151261  country_7  North America
1  2458151262  country_7  South America
2  2458151263  country_7         Africa
3  2458151264  country_7         Europe
4  2458151265  country_8  North America

In [33]:
article_read[['user_id','country','topic'].country == 'country_2'].head()

AttributeError: 'list' object has no attribute 'country'

In [34]:
article_read[article_read[['user_id','country','topic']].country == 'country_2'].head()

            my_datetime event    country     user_id  source   topic
6   2018-01-01 00:06:06  read  country_2  2458151267  Reddit  Europe
13  2018-01-01 00:09:29  read  country_2  2458151274  Reddit  Europe
17  2018-01-01 00:13:06  read  country_2  2458151278  Reddit    Asia
19  2018-01-01 00:14:53  read  country_2  2458151280  Reddit    Asia
20  2018-01-01 00:15:44  read  country_2  2458151281  Reddit    Asia

In [38]:
article_read[article_read.country == 'country_2',[['user_id','country','topic']]].head()

TypeError: '(0       False
1       False
2       False
3       False
4       False
        ...
1790     True
1791    False
1792    False
1793    False
1794    False
Name: country, Length: 1795, dtype: bool, [['user_id', 'country', 'topic']])' is an invalid key

In [39]:
article_read[article_read.country == 'country_2'][['user_id','country','topic']].head()

       user_id    country   topic
6   2458151267  country_2  Europe
13  2458151274  country_2  Europe
17  2458151278  country_2    Asia
19  2458151280  country_2    Asia
20  2458151281  country_2    Asia

In [43]:
filter_country = article_read[article_read.country == 'country_2']
filter_col = filter_country[['user_id','country','topic']]
select_head = filter_col.head()

In [44]:
select_head

       user_id    country   topic
6   2458151267  country_2  Europe
13  2458151274  country_2  Europe
17  2458151278  country_2    Asia
19  2458151280  country_2    Asia
20  2458151281  country_2    Asia

In [45]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [46]:
zoo.groupby('animal').mean()[['water_need']]

          water_need
animal
elephant  550.000000
kangaroo  416.666667
lion      477.500000
tiger     310.000000
zebra     184.285714

In [49]:
article_read

              my_datetime event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [52]:
article_read.groupby('source').count().user_id

source
AdWords    500
Reddit     949
SEO        346
Name: user_id, dtype: int64

In [53]:
filter_country

              my_datetime event    country     user_id   source          topic
6     2018-01-01 00:06:06  read  country_2  2458151267   Reddit         Europe
13    2018-01-01 00:09:29  read  country_2  2458151274   Reddit         Europe
17    2018-01-01 00:13:06  read  country_2  2458151278   Reddit           Asia
19    2018-01-01 00:14:53  read  country_2  2458151280   Reddit           Asia
20    2018-01-01 00:15:44  read  country_2  2458151281   Reddit           Asia
...                   ...   ...        ...         ...      ...            ...
1782  2018-01-01 23:53:03  read  country_2  2458153043  AdWords           Asia
1784  2018-01-01 23:54:03  read  country_2  2458153045      SEO  North America
1785  2018-01-01 23:54:26  read  country_2  2458153046  AdWords         Africa
1787  2018-01-01 23:54:45  read  country_2  2458153048   Reddit           Asia
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America

[462 rows x 6 columns]

In [60]:
freq_source = filter_country.groupby('source').count().user_id

In [61]:
freq_source

source
AdWords    111
Reddit     263
SEO         88
Name: user_id, dtype: int64

In [62]:
freq_topic = filter_country.groupby('topic').count().user_id

In [63]:
freq_topic

topic
Africa            34
Asia             179
Australia         34
Europe            79
North America     80
South America     56
Name: user_id, dtype: int64

In [64]:
freq = filter_country.groupby(['source','topic']).count().user_id

In [65]:
freq

source   topic
AdWords  Africa             3
         Asia              31
         Australia          6
         Europe            46
         North America     11
         South America     14
Reddit   Africa            24
         Asia             139
         Australia         18
         Europe            29
         North America     27
         South America     26
SEO      Africa             7
         Asia               9
         Australia         10
         Europe             4
         North America     42
         South America     16
Name: user_id, dtype: int64

In [68]:
freq = filter_country.groupby(['source','topic']).count()[['user_id']]

In [69]:
freq

                       user_id
source  topic
AdWords Africa               3
        Asia                31
        Australia            6
        Europe              46
        North America       11
        South America       14
Reddit  Africa              24
        Asia               139
        Australia           18
        Europe              29
        North America       27
        South America       26
SEO     Africa               7
        Asia                 9
        Australia           10
        Europe               4
        North America       42
        South America       16

In [71]:
zoo_eats = pd.read_csv('zoo_eats.csv', delimiter=';')

In [72]:
zoo_eats

     animal        food
0  elephant  vegetables
1     tiger        meat
2  kangaroo  vegetables
3     zebra  vegetables
4   giraffe  vegetables